app/controllers/spree/orders_controller.rb

    def populate
      order    = current_order(create_order_if_necessary: true)
      variant  = Spree::Variant.find(params[:variant_id])
      quantity = params[:quantity].to_i
      options  = params[:options] || {}
      direccion = params[:direccion]
      cliente = params[:name]
      code = params[:code]
      puts "AAAAAAAAAAAAA"
      puts code
      sku = params[:sku]
      price = params[:price].to_i
      #TODO: Cambiar el precio de venta de los skus

      # 2,147,483,647 is crazy. See issue #2695.
      if quantity.between?(1, 2_147_483_647)
        order.contents.add(variant, quantity, options)
        order.update_line_item_prices!
        order.create_tax_charge!
---
UPDATE "spree_line_items" SET "non_taxable_adjustment_total" = 0, "taxable_adjustment_total" = 0.0, "promo_total" = 0.0, "included_tax_total" = 0, "additional_tax_total" = 0, "adjustment_total" = 0.0, "updated_at" = '2017-06-06 22:12:05.214623' WHERE "spree_line_items"."id" = $1  [["id", 1]]
INSERT INTO "spree_line_items" ("quantity", "variant_id", "currency", "price", "order_id", "tax_category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"